In [73]:
# https://www.perplexity.ai/search/airline-date-of-journey-source-fkvYOhUHSemRi8MnO3gGAg- data model

import pandas as pd
from sqlalchemy import create_engine, types
from datetime import datetime

# Example for MySQL:
engine = create_engine('mysql+mysqlconnector://root:root@localhost:3306/sys')

data = pd.read_csv('data/Flight_data.csv')

data['Route'] = data['Route'].str.replace('?', ',', regex=False)
data = data.rename(columns={
    "Airline": "airline",
    "Date_of_Journey": "journey_date",
    "Source": "source",
    "Destination": "destination",
    "Route": "route",
    "Dep_Time": "dep_time",
    "Arrival_Time": "arrival_time",
    "Duration": "duration",
    "Total_Stops": "total_stops",
    "Additional_Info": "additional_info",
    "Price": "price"
})

data['route']= data['route'].astype(str)
data['journey_id'] = data.index + 1
data['arrival_time']= data['arrival_time'].str.split(' ').apply(lambda x: x[1] if len(x)>1 else x[0])
data['departure'] = data['journey_date'].str.cat(data['dep_time'], sep=' ')
data["departure"] = pd.to_datetime(data["departure"], format='%d-%m-%Y %H:%M')
data['arrival_time'] = data['arrival_time'].str.strip()
data['arrival_time'] = pd.to_datetime(data['arrival_time'], format='%H:%M').dt.time
data['duration'] = pd.to_timedelta(data['duration'].str.replace('h', ' hours ').str.replace('m', ' minutes'))
data['arrival'] = data['departure'] + data['duration']
print(data['arrival_time'].dtypes)
data

object

,airline,journey_date,source,destination,route,dep_time,arrival_time,duration,total_stops,additional_info,price,journey_id,departure,arrival
0,IndiGo,24-03-2019,Banglore,New Delhi,"BLR , DEL",22:20,01:10:00,0 days 02:50:00,non-stop,No info,3897,1,2019-03-24 22:20:00,2019-03-25 01:10:00
1,Air India,01-05-2019,Kolkata,Banglore,"CCU , IXR , BBI , BLR",05:50,13:15:00,0 days 07:25:00,2 stops,No info,7662,2,2019-05-01 05:50:00,2019-05-01 13:15:00
2,Jet Airways,09-06-2019,Delhi,Cochin,"DEL , LKO , BOM , COK",09:25,04:25:00,0 days 19:00:00,2 stops,No info,13882,3,2019-06-09 09:25:00,2019-06-10 04:25:00
3,IndiGo,12-05-2019,Kolkata,Banglore,"CCU , NAG , BLR",18:05,23:30:00,0 days 05:25:00,1 stop,No info,6218,4,2019-05-12 18:05:00,2019-05-12 23:30:00
4,IndiGo,01-03-2019,Banglore,New Delhi,"BLR , NAG , DEL",16:50,21:35:00,0 days 04:45:00,1 stop,No info,13302,5,2019-03-01 16:50:00,2019-03-01 21:35:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10678,Air Asia,09-04-2019,Kolkata,Banglore,"CCU , BLR",19:55,22:25:00,0 days 02:30:00,non-stop,No info,4107,10679,2019-04-09 19:55:00,2019-04-09 22:25:00
10679,Air India,27-04-2019,Kolkata,Banglore,"CCU , BLR",20:45,23:20:00,0 days 02:35:00,non-stop,No info,4145,10680,2019-04-27 20:45:00,2019-04-27 23:20:00
10680,Jet Airways,27-04-2019,Banglore,Delhi,"BLR , DEL",08:20,11:20:00,0 days 03:00:00,non-stop,No info,7229,10681,2019-04-27 08:20:00,2019-04-27 11:20:00
10681,Vistara,01-03-2019,Banglore,New Delhi,"BLR , DEL",11:30,14:10:00,0 days 02:40:00,non-stop,No info,12648,10682,2019-03-01 11:30:00,2019-03-01 14:10:00
10682,Air India,09-05-2019,Delhi,Cochin,"DEL , GOI , BOM , COK",10:55,19:15:00,0 days 08:20:00,2 stops,No info,11753,10683,2019-05-09 10:55:00,2019-05-09 19:15:00

In [74]:
airline = data[['airline']].drop_duplicates().reset_index(drop=True)
airline['airline_id'] = airline.index + 1

airline

dtype_dict = {
    'airline_id': types.BIGINT(),
    'name': types.VARCHAR(20)
}

airline.to_sql('airline', con=engine, if_exists='replace', index=False, dtype=dtype_dict)

-1

In [75]:
# airport=data[['source','route']]
# airport['source_cd'] = data['route'].str.split(',').str[0] # study about .loc[row_indexer,col_indexer]
# airport['destination'] = data[['destination']]
# airport['destination_cd'] = data['route'].str.split(',').str[-1]

# airport = pd.concat([
#     airport[['source', 'source_cd']].rename(columns={'source': 'name', 'source_cd': 'code'}),
#     airport[['destination', 'destination_cd']].rename(columns={'destination': 'name', 'destination_cd': 'code'})
# ], ignore_index=True)

# airport['name'] = airport['name'].str.strip()
# airport['code'] = airport['code'].str.strip()
# airport['country'] = 'India'  # Assuming all airports are in India
# airport = airport.drop_duplicates(subset=['name', 'code']).dropna().reset_index(drop=True)
# airport['airport_id'] = airport.index + 1
# airport = airport[airport['code'] != 'nan']

# airport 

# # dtype_airport = {
# #     'airport_id': types.BIGINT(),
# #     'country': types.VARCHAR(20),
# #     'code': types.VARCHAR(20),
# #     'name': types.VARCHAR(20)
# # }

# # airport.to_sql('airport', con=engine, if_exists='replace', index=False, dtype=dtype_airport)
# # airport

In [76]:
# Select needed columns
airport = data[['source', 'destination', 'route']].copy()

# Split route into list once and reuse
split_route = airport['route'].str.split(',')

airport['source_cd'] = split_route.str[0]
airport['destination_cd'] = split_route.str[-1]

# Reshape into long format in one step
airport = pd.concat([
    airport[['source', 'source_cd']].rename(columns={'source': 'name', 'source_cd': 'code'}),
    airport[['destination', 'destination_cd']].rename(columns={'destination': 'name', 'destination_cd': 'code'})
], ignore_index=True)

# Clean and finalize
airport['name'] = airport['name'].str.strip()
airport['code'] = airport['code'].str.strip()
airport = airport.dropna(subset=['name', 'code']).drop_duplicates(subset=['name', 'code']).reset_index(drop=True)
airport['country'] = 'India'
airport['airport_id'] = range(1, len(airport) + 1)
airport["code"] = airport["code"].str.strip()

# Drop invalid "nan" string codes
airport = airport[airport['code'] != 'nan']
airport

        name code country  airport_id
0   Banglore  BLR   India           1
1    Kolkata  CCU   India           2
2      Delhi  DEL   India           3
3    Chennai  MAA   India           4
4     Mumbai  BOM   India           5
6  New Delhi  DEL   India           7
7     Cochin  COK   India           8
8  Hyderabad  HYD   India           9

In [77]:
price = data[['price']].drop_duplicates().reset_index(drop=True)
price['currency'] = 'INR'
price['price_id'] = price.index + 1 
price

dtype_price = {
    'price_id': types.BIGINT(),
    'price': types.Float(20),
    'currency': types.VARCHAR(20)
}

price.to_sql('price', con=engine, if_exists='replace', index=False, dtype=dtype_price)

-1

In [78]:
routes = data[['route']].drop_duplicates().dropna().reset_index(drop=True)
routes['stops']= routes['route'].str.count(',')
routes['route_id'] = routes.index + 1
routes

dtype_route = {
    'route_id': types.BIGINT(),
    'stops': types.INTEGER(),
    'route': types.VARCHAR(40)
}

routes.to_sql('route', con=engine, if_exists='replace', index=False, dtype=dtype_route)

routes

                                 route  stops  route_id
0                            BLR , DEL      1         1
1                CCU , IXR , BBI , BLR      3         2
2                DEL , LKO , BOM , COK      3         3
3                      CCU , NAG , BLR      2         4
4                      BLR , NAG , DEL      2         5
..                                 ...    ...       ...
124        BLR , HBX , BOM , NAG , DEL      4       125
125                                nan      0       126
126              BLR , BOM , IXC , DEL      3       127
127  BLR , CCU , BBI , HYD , VGA , DEL      5       128
128                    BOM , BBI , HYD      2       129

[129 rows x 3 columns]

In [79]:
route_detail = (
    data['route']
    .str.strip()
    .str.split(',')
    .explode()
    .reset_index()
    .rename(columns={'index': 'route_dtls_id', 'route': 'route'})
)

route_detail

       route_dtls_id  route
0                  0   BLR
1                  0    DEL
2                  1   CCU
3                  1   IXR
4                  1   BBI
...              ...    ...
30164          10681    DEL
30165          10682   DEL
30166          10682   GOI
30167          10682   BOM
30168          10682    COK

[30169 rows x 2 columns]

In [80]:
route_detail["route"] = route_detail["route"].str.strip()
airport["code"] = airport["code"].str.strip()

route_detail['route_dtls_id'] += 1
route_detail = route_detail.merge(airport, left_on='route', right_on='code', how='left')
route_detail = route_detail[['route_dtls_id', 'airport_id', 'route','code']]
route_detail['airport_id'] = route_detail['airport_id'].fillna(-1)
route_detail['airport_id'] = route_detail['airport_id'].astype(int)
route_detail

dtype_route_dtls = {
    'route_dtls_id': types.BIGINT(),
    'airport_id': types.BIGINT(),
    'route': types.VARCHAR(10)
}

route_detail.to_sql('route_detail', con=engine, if_exists='replace', index=False, dtype=dtype_route_dtls)
airport

        name code country  airport_id
0   Banglore  BLR   India           1
1    Kolkata  CCU   India           2
2      Delhi  DEL   India           3
3    Chennai  MAA   India           4
4     Mumbai  BOM   India           5
6  New Delhi  DEL   India           7
7     Cochin  COK   India           8
8  Hyderabad  HYD   India           9

In [81]:
journey_table = data

# Merge with airline, keep only relevant columns
journey_table = journey_table.merge(
    airline[['airline', 'airline_id']], on='airline', how='left'
)

# Merge to get source airport info, rename duplicated airport_id as source_id
journey_table = journey_table.merge(
    airport, left_on='source', right_on='name', how='left',
    suffixes=('', '_source')
).rename(columns={'airport_id': 'source_id'})

# Merge to get destination airport info, rename duplicated airport_id as destination_id
journey_table = journey_table.merge(
    airport, left_on='destination', right_on='name', how='left',
    suffixes=('', '_destination')
).rename(columns={'airport_id': 'destination_id'})

# Merge price
journey_table = journey_table.merge(
    price[['price', 'price_id']], on='price', how='left'
)

# Merge route_detail by journey_id = route_id (assuming these have same values but different column names)
journey_table = journey_table.merge(
    route_detail[['route_dtls_id']], left_on='journey_id', right_on='route_dtls_id', how='left').groupby('journey_id').first().reset_index()

# Select only needed columns finally
journey_table = journey_table[
    ['journey_id', 'airline_id', 'source', 'source_id', 'destination', 'destination_id', 'price_id', 'route_dtls_id','additional_info','departure','arrival']
]

journey_table['total_stops'] = (
    data['total_stops']
    .str.strip()
    .replace({'non-stop': 1, '1 stop': 1, '2 stops': 2, '3 stops': 3, '4 stops': 4, 'NA': 0, 'inf': 0})
    .fillna(0)
    .astype(int)
)

print(journey_table.dtypes)



dtype_journey_dtls = {
    'journey_id': types.BIGINT(),
    'airline_id': types.BIGINT(),
    'source': types.VARCHAR(10),
    'source_id': types.BIGINT(),
    'destination': types.VARCHAR(20),
    'price_id': types.BIGINT(),
    'route_dtls_id': types.BIGINT(),
    'additional_info': types.VARCHAR(45),
    'departure': types.DATETIME(),
    'arrival': types.DATETIME(),
}

journey_table.to_sql('journey_dtls', con=engine, if_exists='replace', index=False, dtype=dtype_journey_dtls)

journey_table

C:\Users\ANKUSH\AppData\Local\Temp\ipykernel_13388\3605943099.py:37: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  .replace({'non-stop': 1, '1 stop': 1, '2 stops': 2, '3 stops': 3, '4 stops': 4, 'NA': 0, 'inf': 0})

journey_id                  int64
airline_id                  int64
source                     object
source_id                   int64
destination                object
destination_id              int64
price_id                    int64
route_dtls_id               int64
additional_info            object
departure          datetime64[ns]
arrival            datetime64[ns]
total_stops                 int64
dtype: object

,journey_id,airline_id,source,source_id,destination,destination_id,price_id,route_dtls_id,additional_info,departure,arrival,total_stops
0,1,1,Banglore,1,New Delhi,7,1,1,No info,2019-03-24 22:20:00,2019-03-25 01:10:00,1
1,2,2,Kolkata,2,Banglore,1,2,2,No info,2019-05-01 05:50:00,2019-05-01 13:15:00,2
2,3,3,Delhi,3,Cochin,8,3,3,No info,2019-06-09 09:25:00,2019-06-10 04:25:00,2
3,4,1,Kolkata,2,Banglore,1,4,4,No info,2019-05-12 18:05:00,2019-05-12 23:30:00,1
4,5,1,Banglore,1,New Delhi,7,5,5,No info,2019-03-01 16:50:00,2019-03-01 21:35:00,1
...,...,...,...,...,...,...,...,...,...,...,...,...
10678,10679,8,Kolkata,2,Banglore,1,439,10679,No info,2019-04-09 19:55:00,2019-04-09 22:25:00,1
10679,10680,2,Kolkata,2,Banglore,1,868,10680,No info,2019-04-27 20:45:00,2019-04-27 23:20:00,1
10680,10681,3,Banglore,1,Delhi,3,73,10681,No info,2019-04-27 08:20:00,2019-04-27 11:20:00,1
10681,10682,7,Banglore,1,New Delhi,7,1870,10682,No info,2019-03-01 11:30:00,2019-03-01 14:10:00,1
10682,10683,2,Delhi,3,Cochin,8,230,10683,No info,2019-05-09 10:55:00,2019-05-09 19:15:00,2